In [1]:
import pandas as pd

In [6]:
data=pd.read_csv("nba-2.csv",index_col = "Name")

In [7]:
data.head()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Selecting Single Column

In [9]:
age = data["Age"]
print(age)

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

Selecting Multiple Column

In [13]:
columns = data[["Age","College","Salary"]]
print(columns)

                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0
...             ...                ...        ...
Shelvin Mack   26.0             Butler  2433333.0
Raul Neto      24.0                NaN   900000.0
Tibor Pleiss   26.0                NaN  2900000.0
Jeff Withey    26.0             Kansas   947276.0
NaN             NaN                NaN        NaN

[458 rows x 3 columns]

.loc[] -> Selects the data by the label of rows and columns

Selecting Single Row

In [16]:
first_row = data.loc["Shelvin Mack"]
print(first_row)

Team        Utah Jazz
Number            8.0
Position           PG
Age              26.0
Height            6-3
Weight          203.0
College        Butler
Salary      2433333.0
Name: Shelvin Mack, dtype: object

Selecting Multiple Rows

In [26]:
rows = data.loc[["Avery Bradley","R.J. Hunter"]]
print(rows)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0

                     College     Salary
Name
Avery Bradley          Texas  7730337.0
R.J. Hunter    Georgia State  1148640.0

Selecting Two rows and three columns

In [22]:
data_nba = data.loc[["Avery Bradley", "R.J. Hunter"], 
                   ["Team", "Number", "Position"]] 
print(data_nba)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
R.J. Hunter    Boston Celtics    28.0       SG

All rows and Some Columns

In [25]:
data_nba = data.loc[:, 
                   ["Team", "Number", "Position"]] 
print(data_nba)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
Jae Crowder    Boston Celtics    99.0       SF
John Holland   Boston Celtics    30.0       SG
R.J. Hunter    Boston Celtics    28.0       SG
Jonas Jerebko  Boston Celtics     8.0       PF
...                       ...     ...      ...
Shelvin Mack        Utah Jazz     8.0       PG
Raul Neto           Utah Jazz    25.0       PG
Tibor Pleiss        Utah Jazz    21.0        C
Jeff Withey         Utah Jazz    24.0        C
NaN                       NaN     NaN      NaN

[458 rows x 3 columns]

In [28]:
row2 = data.iloc[3]
print(row2)

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

Selecting Multiple Rows

In [30]:
data_nba = data.iloc[[3,4,5]]
print(data_nba)

                         Team  Number Position   Age Height  Weight  \
Name
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
Amir Johnson   Boston Celtics    90.0       PF  29.0    6-9   240.0

                     College      Salary
Name
R.J. Hunter    Georgia State   1148640.0
Jonas Jerebko            NaN   5000000.0
Amir Johnson             NaN  12000000.0

In [31]:
data_nba = data.iloc[[3,4],[1,2]]
print(data_nba)

               Number Position
Name
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF

In [32]:
data_nba = data.iloc[:,[1,2]]
print(data_nba)

               Number Position
Name
Avery Bradley     0.0       PG
Jae Crowder      99.0       SF
John Holland     30.0       SG
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF
...               ...      ...
Shelvin Mack      8.0       PG
Raul Neto        25.0       PG
Tibor Pleiss     21.0        C
Jeff Withey      24.0        C
NaN               NaN      NaN

[458 rows x 2 columns]

.ix[] indexer

This only works where the index of the DataFrame is not integer based .ix will accept any of the inputs of .loc and .iloc.

The .ix indexer has been deprecated in recent versions of Pandas.

In [36]:
data_nba = data[0:3]
print(data_nba)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN

In [38]:
data_nba = data[:3]
print(data_nba)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN

In [46]:
data_nba = data[450:]
print(data_nba)

                    Team  Number Position   Age Height  Weight   College  \
Name
Joe Ingles     Utah Jazz     2.0       SF  28.0    6-8   226.0       NaN
Chris Johnson  Utah Jazz    23.0       SF  26.0    6-6   206.0    Dayton
Trey Lyles     Utah Jazz    41.0       PF  20.0   6-10   234.0  Kentucky
Shelvin Mack   Utah Jazz     8.0       PG  26.0    6-3   203.0    Butler
Raul Neto      Utah Jazz    25.0       PG  24.0    6-1   179.0       NaN
Tibor Pleiss   Utah Jazz    21.0        C  26.0    7-3   256.0       NaN
Jeff Withey    Utah Jazz    24.0        C  26.0    7-0   231.0    Kansas
NaN                  NaN     NaN      NaN   NaN    NaN     NaN       NaN

                  Salary
Name
Joe Ingles     2050000.0
Chris Johnson   981348.0
Trey Lyles     2239800.0
Shelvin Mack   2433333.0
Raul Neto       900000.0
Tibor Pleiss   2900000.0
Jeff Withey     947276.0
NaN                  NaN

In [49]:
data_nba = data[0:5:2]
print(data_nba)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
John Holland   Boston University        NaN
Jonas Jerebko                NaN  5000000.0

Apply Functions

In [50]:
data.columns

Index(['Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College',
       'Salary'],
      dtype='object')

In [53]:
print(max(data["Salary"]))
print(min(data["Salary"]))

25000000.0
30888.0

In [58]:
def salary_func(x,h,l):
    if x > h:
        return "High"
    if x > l:
        return "Mid"
    return "Low"

data["Salary"].apply(salary_func, args = [1000000,60000])

Name
Avery Bradley    High
Jae Crowder      High
John Holland      Low
R.J. Hunter      High
Jonas Jerebko    High
                 ...
Shelvin Mack     High
Raul Neto         Mid
Tibor Pleiss     High
Jeff Withey       Mid
NaN               Low
Name: Salary, Length: 458, dtype: object

In [59]:
#Returnd mode of each columns (Summary row)
#mode is most common values
def mode(x):
    return x.mode()

data.apply(mode,axis=0)

,Team,Number,Position,Age,Height,Weight,College,Salary
0,New Orleans Pelicans,5.0,SG,24.0,6-9,220.0,Kentucky,947276.0

In [61]:
#Apply function to each row
# max length of all the objects in that row 
def max_str_len(x):
    return max([len(str(v)) for v in x])

data.apply(max_str_len , axis = 1)

Name
Avery Bradley    14
Jae Crowder      14
John Holland     17
R.J. Hunter      14
Jonas Jerebko    14
                 ..
Shelvin Mack      9
Raul Neto         9
Tibor Pleiss      9
Jeff Withey       9
NaN               3
Length: 458, dtype: int64

In [63]:
def make_string(x):
    return f"{x.Team} in Position {x.Position}"

data.apply(make_string,axis = 1)

Name
Avery Bradley    Boston Celtics in Position PG
Jae Crowder      Boston Celtics in Position SF
John Holland     Boston Celtics in Position SG
R.J. Hunter      Boston Celtics in Position SG
Jonas Jerebko    Boston Celtics in Position PF
                             ...
Shelvin Mack          Utah Jazz in Position PG
Raul Neto             Utah Jazz in Position PG
Tibor Pleiss           Utah Jazz in Position C
Jeff Withey            Utah Jazz in Position C
NaN                        nan in Position nan
Length: 458, dtype: object

In [73]:
print(data['Number'].apply(lambda x : x+5).head())
print(data['Number'].head())

Name
Avery Bradley      5.0
Jae Crowder      104.0
John Holland      35.0
R.J. Hunter       33.0
Jonas Jerebko     13.0
Name: Number, dtype: float64
Name
Avery Bradley     0.0
Jae Crowder      99.0
John Holland     30.0
R.J. Hunter      28.0
Jonas Jerebko     8.0
Name: Number, dtype: float64

In [76]:
data.dtypes

Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

Aggregate Functions

In [80]:
data.aggregate({"Number":['sum','min'],
               "Age":['max','min'],
               "Salary":['sum']})

     Number   Age        Salary
sum  8079.0   NaN  2.159837e+09
min     0.0  19.0           NaN
max     NaN  40.0           NaN

In [82]:
data[['Age','Salary']].aggregate('min')

Age          19.0
Salary    30888.0
dtype: float64

In [93]:
data.groupby('Team')[['Age','Salary']].aggregate(['max','min'])

                         Age            Salary
                         max   min         max        min
Team
Atlanta Hawks           35.0  22.0  18671659.0   525093.0
Boston Celtics          29.0  20.0  12000000.0  1148640.0
Brooklyn Nets           32.0  21.0  19689000.0   134215.0
Charlotte Hornets       31.0  21.0  13500000.0   189455.0
Chicago Bulls           35.0  21.0  20093064.0   525093.0
Cleveland Cavaliers     35.0  24.0  22970500.0   111196.0
Dallas Mavericks        37.0  22.0  16407500.0   525093.0
Denver Nuggets          36.0  20.0  14000000.0   258489.0
Detroit Pistons         36.0  20.0  16000000.0   111444.0
Golden State Warriors   33.0  20.0  15501000.0   289755.0
Houston Rockets         38.0  22.0  22359364.0   200600.0
Indiana Pacers          30.0  20.0  17120106.0   211744.0
Los Angeles Clippers    39.0  23.0  21468695.0   111444.0
Los Angeles Lakers      37.0  20.0  25000000.0   525093.0
Memphis Grizzlies       39.0  21.0  19688000.0   700902.0
Miami Heat              36.0  20.0  22192730.0   261894.0
Milwaukee Bucks         32.0  19.0  16407500.0   295327.0
Minnesota Timberwolves  40.0  20.0  12700000.0   947276.0
New Orleans Pelicans    31.0  23.0  15514031.0    55722.0
New York Knicks         34.0  20.0  22875000.0    30888.0
Oklahoma City Thunder   38.0  21.0  20158622.0   222888.0
Orlando Magic           32.0  20.0  11250000.0   845059.0
Philadelphia 76ers      37.0  20.0   6500000.0   525093.0
Phoenix Suns            33.0  19.0  13500000.0    55722.0
Portland Trail Blazers  34.0  20.0   8042895.0   525093.0
Sacramento Kings        36.0  22.0  15851950.0   525093.0
San Antonio Spurs       40.0  22.0  19689000.0   200600.0
Toronto Raptors         36.0  20.0  13600000.0   245177.0
Utah Jazz               28.0  20.0  15409570.0   900000.0
Washington Wizards      34.0  20.0  15851950.0   200600.0

Summarizing

In [97]:
data.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [102]:
data['Team'].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [103]:
data['Team'].nunique()

30

In [104]:
data.columns

Index(['Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College',
       'Salary'],
      dtype='object')

In [105]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 458 entries, Avery Bradley to nan
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Team      457 non-null    object
 1   Number    457 non-null    float64
 2   Position  457 non-null    object
 3   Age       457 non-null    float64
 4   Height    457 non-null    object
 5   Weight    457 non-null    float64
 6   College   373 non-null    object
 7   Salary    446 non-null    float64
dtypes: float64(4), object(4)
memory usage: 48.4+ KB